/****************************************Copyright (c)****************************************************
**                            Guangzhou ZHIYUAN electronics Co.,LTD.
**
**                                 http://www.embedtools.com
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               s3c_clock.h
** Last modified Date:      2010-10-14
** Last Version:            1.0.0
** Descriptions:            S3C6410 的时钟配置
**
**--------------------------------------------------------------------------------------------------------
** Created by:              jiaojinxing
** Created date:            2010-10-14
** Version:                 1.0.0
** Descriptions:            S3C6410 的时钟配置
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/
#ifndef S3C_CLOCK_H_
#define S3C_CLOCK_H_


/*********************************************************************************************************
** Function name:           s3c64xx_gate
** Descriptions:            配置 S3C6410 的 S3C_HCLK_GATE 等寄存器
** input parameters:        uiReg               寄存器(S3C_HCLK_GATE, S3C_SCLK_GATE, S3C_PCLK_GATE)
**                          uiCtrlBit           控制位(S3C_CLKCON_XCLK_XXX, 见 "regs-clock.h" 文件)
**                          bEnable             是否使能
** output parameters:       NONE
** Returned value:          NONE
** Created by:              jiaojinxing
** Created Date:            2010-10-14
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
**--------------------------------------------------------------------------------------------------------
*********************************************************************************************************/
VOID s3c64xx_gate(UINT32  uiReg,
                  UINT32  uiCtrlBit,
                  BOOL    bEnable);

#define clkSrcGate      s3c64xx_gate

#endif                                                                  /*  S3C_CLOCK_H_                */
/*********************************************************************************************************
    END FILE
*********************************************************************************************************/
