/****************************************Copyright (c)*****************************************************
**                            Guangzhou ZHIYUAN electronics Co.,LTD.
**                                      
**                                 http://www.embedtools.com
**
**--------------File Info----------------------------------------------------------------------------------
** File name:               wtd.c
** Last modified Date:      2011-12-12
** Last Version:            1.0.0
** Descriptions:            Watch Dog 驱动
**
**---------------------------------------------------------------------------------------------------------
** Created by:              WangDongfang
** Created date:            2011-12-12
** Version:                 1.0.0
** Descriptions:            Watch Dog 驱动
**
**---------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Version:                 
** Descriptions:            
**
**********************************************************************************************************/
#if 0
#include <vxWorks.h>
#include <intLib.h>
#include <stdio.h>
#endif
#include <dfewos.h>

#include "wtd.h"

/**********************************************************************************************************
  看门狗控制器寄存器
**********************************************************************************************************/
#define rWTCON               *(volatile unsigned *)0x7E004000           /* Watchdog timer control        */
#define rWTDAT               *(volatile unsigned *)0x7E004004           /* Watchdog timer data           */
#define rWTCNT               *(volatile unsigned *)0x7E004008           /* Watchdog timer count          */
#define rWTCLRINT            *(volatile unsigned *)0x7E00400C           /* Watchdog timer interrupt clear*/

/**********************************************************************************************************
  全局变量
**********************************************************************************************************/
static unsigned short __GusCount;

/**********************************************************************************************************
** Function name:           wtdStart
** Descriptions:            启动 看门狗
                            启动看门狗后, 必须不断的调用 wtdClear() 以避免系统复位, 直到停止 看门狗
                            如果在 【count * 16 * (0x80 + 1) * (1/PCLK)】 秒之内, 如果没有调用 wtdClear(),
                            则系统就会复位. (PCLK = 66M HZ)
** input parameters:        count: 看门狗复位时间计数 [0, 0xFFFF]
** output parameters:       NONE
** Returned value:          OK
** Created by:              WangDongfang
** Created Date:            2011-12-14
**---------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
**---------------------------------------------------------------------------------------------------------
**********************************************************************************************************/
STATUS wtdStart (unsigned short count)
{
	serial_printf ("count = %d\n", count);
    __GusCount = count;
    rWTDAT = count;
    rWTCNT = count;

    rWTCON = 0x8021;
    return OK;
}

/**********************************************************************************************************
** Function name:           wtdStop
** Descriptions:            停止 看门狗
** input parameters:        NONE
** output parameters:       NONE
** Returned value:          OK
** Created by:              WangDongfang
** Created Date:            2011-12-14
**---------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
**---------------------------------------------------------------------------------------------------------
**********************************************************************************************************/
STATUS wtdStop ()
{
    rWTCON = 0;
    return OK;
}

/**********************************************************************************************************
** Function name:           wtdClear
** Descriptions:            清空 看门狗
                            在启动看门狗后, 调用此函数以防止系统复位
** input parameters:        NONE
** output parameters:       NONE
** Returned value:          OK
** Created by:              WangDongfang
** Created Date:            2011-12-14
**---------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
**---------------------------------------------------------------------------------------------------------
**********************************************************************************************************/
STATUS wtdClear ()
{
    rWTCNT = __GusCount;
    return OK;
}


/*********************************************************************************************************
  END FILE
*********************************************************************************************************/

