/*==============================================================================
** nongli.h -- nong li interface.
**
** MODIFY HISTORY:
**
** 2012-03-08 wdf Create.
==============================================================================*/

#ifndef __NONGLI_H__
#define __NONGLI_H__

#ifdef __cplusplus
extern "C" {
#endif

/*======================================================================
  config
======================================================================*/
#define BEI_ZHU_LEN     64

/*======================================================================
  农历日期结构体
======================================================================*/
typedef struct nongli_date {
    int nian;           /* [1900, 2099] */
    int yue;            /* [1, 12] */
    int ri;             /* [1, 30] */

    char ri_qi[9];      /* "正月初一" */
    char tian_di[5];    /* "甲子" */
    char sheng_xiao[3]; /* "龙" */
    char jie_qi[5];     /* "立春" */

    int  is_run;        /* 是否是闰月 */

    char bei_zhu[BEI_ZHU_LEN];   /* 备注 */

} NONGLI_DATE;


int nongli_get_date (int year, int month, int day, NONGLI_DATE *pNongli);

#ifdef __cplusplus
}
#endif

#endif /* __NONGLI_H__ */

/*==============================================================================
** FILE END
==============================================================================*/
